In [1]:
#PART I: Create a Series

    #1.In Jupyter, navigate to your MIS3320 CourseData/notebook directory.
    #2.Click New=>Python 3 (ipykernel) so that you create a new Jupyter notebook.
    #3.Click File=>Save as… . In the next window, please ensure the file is saved under the notebook/ directory. Save the file as M4Exercise under the notebook directory.

    
#Create a Series

#Series: list of values, is like a library in Pandas; it is like taking one column/row out of a table or spreadsheet
         #a kind of one-dimensional array of any data type that we specified in the pandas module

In [2]:
import pandas as pd

In [3]:
s = pd.Series(['banana', 42])   #creating a series. Case Sensitive
s

#The result is a Series named s.

0    banana
1        42
dtype: object

In [4]:
s = pd.Series(['banana', 42]) 
print(s)

#notice print can also result the output

0    banana
1        42
dtype: object

In [5]:
type(s)  #Now we see the the type is Series here vs DataFrame

pandas.core.series.Series

In [6]:
s[0]    #s is the variable we create, [ ] means to take something out

'banana'

In [7]:
#PART II: Create a DataFrame

#DataFrame: 2-D Spreadsheet structure; with labeled axes (rows and columns). 
#A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

In [8]:
#THIS IS THE FORMAT FOR CREATING A DataFrame

data_name = pd.DataFrame({
    'column1' :['text value 1',  'text value 2',  'text value 3' ],         #text value in  ‘  ‘
    'column2' :['date 1',  'date 2',  'date 3' ],                           #date value in  ‘  ‘
    'column3' :[number 1,  number 2,  number 3 ]},                          #numbers without  ‘  ‘  #note the places of { }
    index=['index1', 'index2', 'index3'],                                   #index is like PK
    columns=['column1', 'column2', 'column3])

#For your reference, the following above is the format for creating a DataFrame. (to know how DataFrame is structured)

SyntaxError: invalid syntax (Temp/ipykernel_14892/3885534387.py, line 6)

In [9]:
#Now create a DataFrame named customers

In [10]:
customers = pd.DataFrame({
    'name':['Rosaline Franklin', 'William Gosset'],
    'occupation':['Chemist', 'Engineer'],
    'dateregister':['2015-02-08', '2021-03-25'],
    'year':[7, 1]},
    index=['c001', 'c002'],
    columns=['name', 'occupation', 'dateregister', 'year']
    
)
customers

#created a customer DataFrame with two customers and four columns here

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c002     William Gosset   Engineer   2021-03-25     1

In [11]:
#Now Modify the above codes to recreate the customers DataFrame 
#This time you should add a third row so that your name appears and details that follows 
#keep the rest of values in previous rows intact

In [12]:
customers = pd.DataFrame({
    'name':['Rosaline Franklin', 'William Gosset', 'Riyan Rattan'],
    'occupation':['Chemist', 'Engineer', 'Student'],
    'dateregister':['2015-02-08', '2021-03-25', '2020-01-15'],
    'year':[7, 1, 4]},
    index=['c001', 'c002', 'c003'],
    columns=['name', 'occupation', 'dateregister', 'year']
    
)
customers

#  We just added a row here with my name

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c002     William Gosset   Engineer   2021-03-25     1
c003       Riyan Rattan    Student   2020-01-15     4

In [13]:
customers['name']

#  takes out and displays name column only

c001    Rosaline Franklin
c002       William Gosset
c003         Riyan Rattan
Name: name, dtype: object

In [14]:
customers.dtypes  

#describes how the bytes in the fixed-size block of memory corresponding to an array item should be interpreted. 
#describes the type of the data (integer, float, Python object, bool,....)

#object:          Text or mixed numeric and non-numeric values
#int64 :          Integer numbers
#float64:         Floating point numbers
#bool:            True/False values
#datetime64:      Date and time values
#timedelta[ns]:   Differences between two datetimes
#category:        Finite list of text values


#Data types are one of those things that you don’t tend to care about until you get an error or some unexpected results. 
#It is also one of the first things you should check once you load a new data into pandas for further analysis.


#Concern examples:

    #The Customer Number is a float64 but it should be an int64
    #The 2016 and 2017 columns are stored as objects, not numerical values such as a float64 or int64
    #Percent Growth and Jan Units are also stored as objects not numerical values
    #We have Month, Day, and Year columns that should be converted to datetime64


#Until we clean up these data types, it is going to be very difficult to do much additional analysis on this data.

#In order to convert data types in pandas, there are three basic options:

        #Use astype() to force an appropriate dtype
        #Create a custom function to convert the data
        #Use pandas functions such as to_numeric() or to_datetime()

name            object
occupation      object
dateregister    object
year             int64
dtype: object

In [15]:
type(customers)   #note what type this is = DataFrame

pandas.core.frame.DataFrame

In [16]:
year_column = customers['year']

In [17]:
type(year_column)

pandas.core.series.Series

In [18]:
customers = pd.DataFrame({
    'name':['Rosaline Franklin', 'William Gosset', 'Riyan Rattan'],
    'occupation':['Chemist', 'Engineer', 'Student'],
    'dateregister':['2015-02-08', '2021-03-25', '2020-01-15'],
    'year':[7, 1, 4]},
    index=['c001', 'c002', 'c003'],
    columns=['name', 'occupation', 'dateregister', 'year']
    
)
customers

#reference for next series of tasks

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c002     William Gosset   Engineer   2021-03-25     1
c003       Riyan Rattan    Student   2020-01-15     4

In [ ]:
#DataFrame can be thought of as a dictionary of Series objects; as Python’s way of storing spreadsheet-like data
#Many of the features of the Series data structure carry over into the DataFrame.

#Series can only contain single list with index, 
#whereas dataframe can be made of more than one series 
#or we can say that a dataframe is a collection of series that can be used to analyse the data

In [19]:
                                #PART III: Get a Series from a DataFrame


#Get a Row from a DataFrame as shown below:

In [20]:
third_row = customers.iloc[2]      #take the third row (2 cause start at zero! 0 is Row 1, 1 is Row 2, 2 is row 3)
third_row

            #use iloc to fetch by row index number; use iloc to get the third row (the row with your name) from customers 
    #uses iloc to get the third row (the row with your name) from customers

name            Riyan Rattan
occupation           Student
dateregister      2020-01-15
year                       4
Name: c003, dtype: object

In [21]:
c003_row = customers.loc['c003']     #does not work if no put 'c003'
c003_row                              #c003 is the same way as third_row but another way

#Write codes to use loc to get the third row (the row with your name) from customers and show the result
#another way

name            Riyan Rattan
occupation           Student
dateregister      2020-01-15
year                       4
Name: c003, dtype: object

In [22]:
multi_columns = customers [['name', 'year']]
multi_columns

#something to experiment

                   name  year
c001  Rosaline Franklin     7
c002     William Gosset     1
c003       Riyan Rattan     4

In [23]:
type(customers)   #naming the type customers is, which is DataFrame

pandas.core.frame.DataFrame

In [24]:
type(year_column)     #columns is a series

pandas.core.series.Series

In [25]:
type(third_row)     #row is a series

pandas.core.series.Series

In [26]:
type(multi_columns)   #more than one columns = data frame

pandas.core.frame.DataFrame

In [27]:
name_column=customers['name']
name_column

c001    Rosaline Franklin
c002       William Gosset
c003         Riyan Rattan
Name: name, dtype: object

In [28]:
name_column=customers[['name']]
name_column

#notice the difference?!

                   name
c001  Rosaline Franklin
c002     William Gosset
c003       Riyan Rattan

In [29]:
type(name_column)    #named it with ( )

pandas.core.frame.DataFrame

In [30]:
type[name_column] #single brackets output different, since it is taking the data out as specified within [ ]

type[                   name
c001  Rosaline Franklin
c002     William Gosset
c003       Riyan Rattan]

In [31]:
year_column=customers['year']          #fetch the year column
year_column

#use [] to get the year column from customers and show the result
#[] means to take something out

c001    7
c002    1
c003    4
Name: year, dtype: int64

In [32]:
year_column    #same results??

c001    7
c002    1
c003    4
Name: year, dtype: int64

In [33]:
                                        #PART IV: Series Methods

In [34]:
year_column.mean()     #What is the mean of year?

4.0

In [35]:
year_column.describe()  #What is the basic descriptive stats of year?

#Use describe().

count    3.0
mean     4.0
std      3.0
min      1.0
25%      2.5
50%      4.0
75%      5.5
max      7.0
Name: year, dtype: float64

In [36]:
type(year_column.describe())   #adding type(   )  tells if series or data frame

pandas.core.series.Series

In [37]:
customers  #to try out

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c002     William Gosset   Engineer   2021-03-25     1
c003       Riyan Rattan    Student   2020-01-15     4

In [38]:
customers.loc['c003', ['name', 'occupation']]

name          Riyan Rattan
occupation         Student
Name: c003, dtype: object

In [39]:
customers.loc['c003', ['name', ]]     #notice the difference, didn't display occupation!

name    Riyan Rattan
Name: c003, dtype: object

In [40]:
#Boolean Subsetting: Series

In [41]:
customers.loc[customers['year'] >2, :]    
                        
                        #    customer.loc will show you the row
                        #    within brackets can show the rows I want to show: the [years] greater than 2 ---the condition
            #Boolean Subsetting: Series
            
            #The following codes above, will fetch rows with year greater than 2. 
            #only choose the rows with year > 2, all columns

                   name occupation dateregister  year
c001  Rosaline Franklin    Chemist   2015-02-08     7
c003       Riyan Rattan    Student   2020-01-15     4

In [42]:
customers['year']>2

c001     True
c002    False
c003     True
Name: year, dtype: bool

In [43]:
customers.loc[customers['occupation']=='Student', :]     #fetch rows with student as the occupation

#The following codes above, will fetch rows with student as the occupation.

              name occupation dateregister  year
c003  Riyan Rattan    Student   2020-01-15     4

In [44]:
                                #PART V: Save a DataFrame into a TSV
    
#To save your customers DataFrame as a TSV file, simply use to_csv()

In [45]:
customers.to_csv('scientists_df.tsv', sep='\t')    #saved as scientists_df.tsv

#customer DataFrame saved to csv (this is file name) and should tab separated file

#tab separated file: tsv  or  csv (comma separated file)